UTAF_Base/requestFiles/BPS_Product_GetRegimes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v1.product.bps.services.bgc" xmlns:urn2="urn:v1.crdmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         
         <urn:endUserId>id058127</urn:endUserId>
         
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         
         <urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataGetRegimes version="1.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id058127</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         
         <urn1:productId>${Req_productId}</urn1:productId>
         <urn1:oneTimeInd>${Req_oneTimeInd}</urn1:oneTimeInd>
      </urn1:RequestDataGetRegimes>
   </soapenv:Body>
</soapenv:Envelope>
